Revit 2026 API

# BalusterPlacementBalusterPerTreadNumber Property

---

The number of balusters per tread.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int BalusterPerTreadNumber { get; set; }
```
```vb
Public Property BalusterPerTreadNumber As Integer
	Get
	Set
```
```cpp
public:
property int BalusterPerTreadNumber {
	int get ();
	void set (int value);
}
```
```fsharp
member BalusterPerTreadNumber : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for balusterPerTreadNumber is not positive. |

Applicable only if UseBalusterPerTreadOnStairs is true.

#### Reference

BalusterPlacement Class

Autodesk.Revit.DB.Architecture Namespace